app/controllers/category_enterprise_controller.rb

	def search_enterprise
		if params[:search]
	      @enterprise = Category.find(params[:id]).enterprises.search(params[:search])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "enterprises".* FROM "enterprises" INNER JOIN "pictures" ON "enterprises"."id" = "pictures"."enterprise_id" WHERE "pictures"."category_id" = ? AND (name like '%C%')  [["category_id", 1]]