app/controllers/rating_controller.rb

	def create
		@enterprise = Enterprise.find(params[:enterprise_id])

		@rating = Rating.where("user_id = ? AND enterprise_id = ?", params[:user_id], params[:enterprise_id])
		if @rating.empty?
			@rating = Rating.create(points: params[:points], enterprise_id: params[:enterprise_id], user_id: params[:user_id])

			@enterprise.ratings << @rating
			if @enterprise.save
				self.calculate_rate
				render json: @enterprise.to_json
			else
				error = {:response => "false"}
				render json: error.to_json
			end
		else
			@rating.each do |rating|
---
SELECT  "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "ratings" ("points", "enterprise_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["points", 3.0], ["enterprise_id", 1], ["user_id", 1], ["created_at", "2015-11-23 17:07:51.414904"], ["updated_at", "2015-11-23 17:07:51.414904"]]
UPDATE "enterprises" SET "rate" = ?, "updated_at" = ? WHERE "enterprises"."id" = ?  [["rate", 3.0], ["updated_at", "2015-11-23 17:15:35.990294"], ["id", 1]]
SELECT AVG("ratings"."points") FROM "ratings" WHERE "ratings"."enterprise_id" = ?  [["enterprise_id", 1]]