app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "w@w.com"]]
---
	def login

		@user = User.find_by_email(user_params[:email]).try(:authenticate, user_params[:password])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", 1]]
---
	def follow_provider
		@user = User.find(params[:id_user])
		@provider = Enterprise.find(params[:id_provider])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def get_user_preference
		@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "preferences" SET "musician" = ?, "band" = ?, "dj" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["musician", "f"], ["band", "f"], ["dj", "t"], ["updated_at", "2015-11-23 18:13:22.575484"], ["id", 5]]
---
	def update_preferences
		@user = User.find(params[:id_user])
		preferences = params[:preferences]
		render json: preferences[0][:budget].to_json
		@user_preferences = @user.preferences

		preferences.each do |new_preference|
			@user_preferences.each do |preference_user|
				if new_preference[:category_id] == preference_user.category_id
					preference_user.budget = new_preference[:budget]
					preference_user.musician = new_preference[:musician]
					preference_user.band = new_preference[:band]
					preference_user.dj = new_preference[:dj]
					preference_user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = ? LIMIT 1  [["id", 1]]
---
	def unfollow_provider
		@user = User.find(params[:id_user])
		@provider = Enterprise.find(params[:id_provider])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
	def show_providers_by_user
		@user = User.find(params[:id_user])

SELECT  "users".* FROM "users" WHERE "users"."phone_number" IN ('number4', '555-522-8243') LIMIT 1
---
	def checkusers
		@current_user = User.find(params[:id_user])
		user = []
		@phone_users = params[:phone_user]
		for phones in @phone_users
			@user = User.find_by_phone_number(phones)