app/controllers/users_controller.rb

SELECT  "preferences".* FROM "preferences" WHERE "preferences"."id" = ? LIMIT 1  [["id", 0]]
---
	def update_preferences
		@user = User.find(1)
		preferences = params[:preferences]
		render json: preferences[0][:budget].to_json

		id = 1
		it = 0
		preferences.each do |p|
			 @preference = Preference.find(id)